using System.Windows;

/*
 * Написать программу, которая копирует файл блоками по 4096 байт в указанное место. 
 * Должна отображать прогресс копирования с помощью ProgressBar. Пользователь
 * может указать пути к файлам с помощью клавиатуры или с помощью диалогового окна, 
 * которое отображается при нажатии кнопок “Файл”. Запуск копирования происходит 
 * при нажатии кнопки “Копировать” или клавиши Enter в текстовом поле, где 
 * указывается путь куда копировать. Решить задачу двумя способами: с помощью 
 * классов Thread, ThreadPool.
 * GUI должен отвечать на действия пользователя в момент работы.
 */


namespace CopyFile
{
    /// <summary>
    ///     Interaction logic for MainWindow.xaml
    /// </summary>
    public partial class MainWindow : Window
    {
        public MainWindow()
        {
            InitializeComponent();
        }
    }
}